src/Catalogs/ВидыПодарочныхСертификатов/ВидыПодарочныхСертификатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыПодарочныхСертификатов</name>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментНоменклатуры</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКарты</name>
    <type>
      <types>EnumRef.ТипыКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействия</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастичнаяОплата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаДоходов</name>
    <type>
      <types>Characteristic.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетПодарочныхСертификатов2_5</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредствПродажа</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредствВозврат</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Бессрочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШаблоныКодовПодарочныхСертификатов</name>
    <attributes>
      <name>ДлинаШтрихкода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДиапазонаШтрихкода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>99</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецДиапазонаШтрихкода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>99</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаМагнитногоКода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДиапазонаМагнитногоКода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>99</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецДиапазонаМагнитногоКода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>99</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонМагнитнойКарты</name>
      <type>
        <types>CatalogRef.ШаблоныМагнитныхКарт</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ВидыПодарочныхСертификатов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает реквизиты объекта, которые необходимо блокировать от изменения
//
// Возвращаемое значение:
//  Массив Из Строка - блокируемые реквизиты объекта.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

	Результат = Новый Массив;
	
	Результат.Добавить("Наименование");
	Результат.Добавить("Организация");
	Результат.Добавить("Номинал");
	Результат.Добавить("ТипКарты");
	Результат.Добавить("УчетПодарочныхСертификатов2_5");
	Результат.Добавить("ПериодДействия");
	Результат.Добавить("КоличествоПериодовДействия");
	Результат.Добавить("СегментНоменклатуры;ИспользоватьСегментНоменклатуры");
	Результат.Добавить("ЧастичнаяОплата;ЧастичнаяОплатаПереключатель");
	Результат.Добавить("ШаблоныКодовПодарочныхСертификатов");
	Результат.Добавить("СчетУчета");
	Результат.Добавить("СтатьяДоходов");
	Результат.Добавить("НастройкаСчетовУчета_СчетУчета_РасчетыПоПодарочнымСертификатам");
	Результат.Добавить("АналитикаДоходов");
	Результат.Добавить("ГруппаФинансовогоУчета");
	Результат.Добавить("СтатьяДвиженияДенежныхСредствПродажа");
	Результат.Добавить("СтатьяДвиженияДенежныхСредствВозврат");
	Результат.Добавить("НаправлениеДеятельности");
	Результат.Добавить("Бессрочный");
	
	Возврат Результат;

КонецФункции

#Область ДляВызоваИзДругихПодсистем

// Заполняет реквизиты параметров настройки счетов учета подарочных сертификатов, которые влияют на настройку,
// 	соответствующими им именам реквизитов аналитики учета.
//
// Параметры:
// 	СоответствиеИмен - Соответствие - ключом выступает имя реквизита, используемое в настройке счетов учета,
// 		значением является соответствующее имя реквизита аналитики учета.
// 
Процедура ЗаполнитьСоответствиеРеквизитовНастройкиСчетовУчета(СоответствиеИмен) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
